In [2]:
import numpy as np
import pandas as pd

In [5]:
dict1 = {

    'Name' : ['Harry','Ashraf','Saif','Vinay','Deepak'],
    'Marks' : [12,34,45,67,45],
    'city' : ['England','Chandauli','Ghundi Kund Kala','Ghazipur','Ghazipur']
}

In [6]:
df = pd.DataFrame(dict1)

In [7]:
df

     Name  Marks              city
0   Harry     12           England
1  Ashraf     34         Chandauli
2    Saif     45  Ghundi Kund Kala
3   Vinay     67          Ghazipur
4  Deepak     45          Ghazipur

In [8]:
df.to_csv('friends.csv')

In [9]:
df.to_csv('friends_index_false.csv', index=False)

In [10]:
df

     Name  Marks              city
0   Harry     12           England
1  Ashraf     34         Chandauli
2    Saif     45  Ghundi Kund Kala
3   Vinay     67          Ghazipur
4  Deepak     45          Ghazipur

In [11]:
df.head(2)

     Name  Marks       city
0   Harry     12    England
1  Ashraf     34  Chandauli

In [12]:
df.tail(3)

     Name  Marks              city
2    Saif     45  Ghundi Kund Kala
3   Vinay     67          Ghazipur
4  Deepak     45          Ghazipur

In [13]:
df.describe()

           Marks
count   5.000000
mean   40.600000
std    19.982492
min    12.000000
25%    34.000000
50%    45.000000
75%    45.000000
max    67.000000

In [18]:
x = pd.read_csv('friends_copy.csv')

In [19]:
x

   S.no.    Name  Marks              city
0      0   Harry     12           England
1      1  Ashraf     34         Chandauli
2      2    Saif     45  Ghundi Kund Kala
3      3   Vinay     67          Ghazipur
4      4  Deepak     45          Ghazipur
5      5   Sahil     70  Ghundi Kund Kala

In [21]:
x['Name'][0] = 'Amjad'

/var/folders/qb/t9nvdqln543b469bd7xzrx340000gp/T/ipykernel_2201/1604436858.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x['Name'][0] = 'Amjad'

In [22]:
x

   S.no.    Name  Marks              city
0      0   Amjad     12           England
1      1  Ashraf     34         Chandauli
2      2    Saif     45  Ghundi Kund Kala
3      3   Vinay     67          Ghazipur
4      4  Deepak     45          Ghazipur
5      5   Sahil     70  Ghundi Kund Kala

In [23]:
x.to_csv('friends_copy.csv')

In [4]:
x1 = pd.read_csv('train.csv')
x1

   S.No.  Train no.  Speed       city
0      1        543    120    ramkola
1      2        798    123  gorakhpur
2      3       5412    567    lucknow
3      4       6547    210     kanpur

In [5]:
x1.head(2)

   S.No.  Train no.  Speed       city
0      1        543    120    ramkola
1      2        798    123  gorakhpur

In [6]:
x1.tail(1)

   S.No.  Train no.  Speed    city
3      4       6547    210  kanpur

In [7]:
x1['Speed']

0    120
1    123
2    567
3    210
Name: Speed, dtype: int64

In [8]:
x1['Speed'][2] = 122

/var/folders/qb/t9nvdqln543b469bd7xzrx340000gp/T/ipykernel_934/1710768143.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x1['Speed'][2] = 122

In [9]:
x1

   S.No.  Train no.  Speed       city
0      1        543    120    ramkola
1      2        798    123  gorakhpur
2      3       5412    122    lucknow
3      4       6547    210     kanpur

In [10]:
x1.to_csv('train.csv')

In [11]:
x1.index = ['first','second','third','fourth']
x1

        S.No.  Train no.  Speed       city
first       1        543    120    ramkola
second      2        798    123  gorakhpur
third       3       5412    122    lucknow
fourth      4       6547    210     kanpur

In [14]:
pd.read_csv('laptops_train.csv')

,Manufacturer,Model Name,Category,Screen Size,Screen,CPU,RAM,Storage,GPU,Operating System,Operating System Version,Weight,Price
0,Apple,MacBook Pro,Ultrabook,"13.3""",IPS Panel Retina Display 2560x1600,Intel Core i5 2.3GHz,8GB,128GB SSD,Intel Iris Plus Graphics 640,macOS,NaN,1.37kg,11912523.48
1,Apple,Macbook Air,Ultrabook,"13.3""",1440x900,Intel Core i5 1.8GHz,8GB,128GB Flash Storage,Intel HD Graphics 6000,macOS,NaN,1.34kg,7993374.48
2,HP,250 G6,Notebook,"15.6""",Full HD 1920x1080,Intel Core i5 7200U 2.5GHz,8GB,256GB SSD,Intel HD Graphics 620,No OS,NaN,1.86kg,5112900.00
3,Apple,MacBook Pro,Ultrabook,"15.4""",IPS Panel Retina Display 2880x1800,Intel Core i7 2.7GHz,16GB,512GB SSD,AMD Radeon Pro 455,macOS,NaN,1.83kg,22563005.40
4,Apple,MacBook Pro,Ultrabook,"13.3""",IPS Panel Retina Display 2560x1600,Intel Core i5 3.1GHz,8GB,256GB SSD,Intel Iris Plus Graphics 650,macOS,NaN,1.37kg,16037611.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...
972,Dell,Alienware 17,Gaming,"17.3""",Full HD 1920x1080,Intel Core i7 6700HQ 2.6GHz,32GB,256GB SSD + 1TB HDD,Nvidia GeForce GTX 1070,Windows,10,4.42kg,24897600.00
973,Toshiba,Tecra A40-C-1DF,Notebook,"14.0""",Full HD 1920x1080,Intel Core i5 6200U 2.3GHz,8GB,256GB SSD,Intel HD Graphics 520,Windows,10,1.95kg,10492560.00
974,Asus,Rog Strix,Gaming,"17.3""",Full HD 1920x1080,Intel Core i7 7700HQ 2.8GHz,16GB,256GB SSD + 1TB HDD,Nvidia GeForce GTX 1060,Windows,10,2.73kg,18227710.80
975,HP,Probook 450,Notebook,"15.6""",IPS Panel Full HD 1920x1080,Intel Core i5 7200U 2.70GHz,8GB,128GB SSD + 1TB HDD,Nvidia GeForce 930MX,Windows,10,2.04kg,8705268.00
976,Lenovo,ThinkPad T460,Notebook,"14.0""",1366x768,Intel Core i5 6200U 2.3GHz,4GB,508GB Hybrid,Intel HD Graphics 520,Windows,7,1.70kg,8909784.00

In [15]:
x2 = pd.Series(np.random.rand(20))

In [16]:
x2

0     0.751327
1     0.435692
2     0.030155
3     0.607927
4     0.653773
5     0.846918
6     0.189602
7     0.652568
8     0.993553
9     0.552354
10    0.183892
11    0.780025
12    0.577712
13    0.082483
14    0.448476
15    0.533684
16    0.347715
17    0.253648
18    0.889512
19    0.578941
dtype: float64

In [17]:
type(x2)

pandas.core.series.Series

In [19]:
x3 = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))
x3

            0         1         2         3         4
0    0.128879  0.204080  0.936664  0.910483  0.415431
1    0.643181  0.395010  0.949221  0.266472  0.471241
2    0.891723  0.753991  0.004351  0.183418  0.222074
3    0.912184  0.300998  0.830616  0.110578  0.834322
4    0.945665  0.954463  0.627215  0.551157  0.262734
..        ...       ...       ...       ...       ...
329  0.765226  0.766687  0.000206  0.396733  0.903900
330  0.676888  0.240575  0.574613  0.106720  0.780051
331  0.885467  0.066359  0.468630  0.070118  0.382941
332  0.080943  0.341879  0.292672  0.000489  0.645131
333  0.869999  0.178714  0.672055  0.070195  0.370892

[334 rows x 5 columns]